Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
 = { # forces replacement
          ~ "timestamp" = "1758684130851384000" -> "1758702849968087000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (deposed object 4845e040) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5955086644095798345" -> null
      - triggers = {
          - "filename"  = "builds/76408ab6569b18b2349025a9480461ae075f7db9418cd088256937bb57a8a8ac.zip"
          - "timestamp" = "1756361686078704200"
        } -> null
    }

  # module.sbeacon.module.lambda-submitDataset.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-submitDataset"
      ~ image_uri                      = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:7217c803912e942e765934a6de423704763e6758be461638c9517b57b099a072" -> (known after apply)
      ~ last_modified                  = "2025-08-28T06:18:06.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-updateFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_binaries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:12",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7224336396574488078" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684130348312000" -> "1758702849010375000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:11" -> (known after apply)
      ~ code_sha256                 = "4XL2O58nZ8wMcMmwcJpnMtBHiKAlP55EbSOeWAvNVkI=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-24T04:24:15.875+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:11" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/bd79faeab2d57258b837d8e3cdc705c4157d90126dce928184d7c10dd47d2e15.zip" -> "builds/dbe0d9ab907c175def5c88938a18cff2c24cb10a23e6d0fca5d7c495c3af0c09.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 24398175 -> (known after apply)
      ~ version                     = "11" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] (deposed object 8d07617e) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lambda_layer_version" "this" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:10" -> null
      - code_sha256                 = "GEYgVtHKiar30PjI8pMgt+P9r+n+au2PphVA3bfWRBE=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-08-28T06:18:18.176+0000" -> null
      - description                 = "python libraries" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:10" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer" -> null
      - layer_name                  = "sbeacon_backend_python_libraries_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - s3_bucket                   = "gaspi-lambda-layers20250519061959773600000003" -> null
      - s3_key                      = "builds/038b6afd1b996bd50fc7bf401c90990f7f8da8fb0515f1754075775ae16fe3f3.zip" -> null
      - skip_destroy                = false -> null
      - source_code_size            = 24399227 -> null
      - version                     = "10" -> null
        # (5 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers20250519061959773600000003/builds/bd79faeab2d57258b837d8e3cdc705c4157d90126dce928184d7c10dd47d2e15.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "a6f025f4ee17ac52a143cd79effb2fa6-5" -> (known after apply)
      ~ id                            = "gaspi-lambda-layers20250519061959773600000003/builds/bd79faeab2d57258b837d8e3cdc705c4157d90126dce928184d7c10dd47d2e15.zip" -> (known after apply)
      ~ key                           = "builds/bd79faeab2d57258b837d8e3cdc705c4157d90126dce928184d7c10dd47d2e15.zip" -> "builds/dbe0d9ab907c175def5c88938a18cff2c24cb10a23e6d0fca5d7c495c3af0c09.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/bd79faeab2d57258b837d8e3cdc705c4157d90126dce928184d7c10dd47d2e15.zip" -> "builds/dbe0d9ab907c175def5c88938a18cff2c24cb10a23e6d0fca5d7c495c3af0c09.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] (deposed object d0bc174b) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_s3_object" "lambda_package" {
      - acl                           = "private" -> null
      - arn                           = "arn:aws:s3:::gaspi-lambda-layers20250519061959773600000003/builds/038b6afd1b996bd50fc7bf401c90990f7f8da8fb0515f1754075775ae16fe3f3.zip" -> null
      - bucket                        = "gaspi-lambda-layers20250519061959773600000003" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "binary/octet-stream" -> null
      - etag                          = "845ef64a9fa65edd46ad048973fa2087-5" -> null
      - force_destroy                 = false -> null
      - id                            = "gaspi-lambda-layers20250519061959773600000003/builds/038b6afd1b996bd50fc7bf401c90990f7f8da8fb0515f1754075775ae16fe3f3.zip" -> null
      - key                           = "builds/038b6afd1b996bd50fc7bf401c90990f7f8da8fb0515f1754075775ae16fe3f3.zip" -> null
      - metadata                      = {} -> null
      - region                        = "ap-southeast-3" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "builds/038b6afd1b996bd50fc7bf401c90990f7f8da8fb0515f1754075775ae16fe3f3.zip" -> null
      - storage_class                 = "ONEZONE_IA" -> null
      - tags                          = {} -> null
      - tags_all                      = {
          - "Environment" = "uat"
          - "NAME"        = "sbeacon-backend"
          - "Owner"       = "gaspi"
        } -> null
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/dbe0d9ab907c175def5c88938a18cff2c24cb10a23e6d0fca5d7c495c3af0c09.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/dbe0d9ab907c175def5c88938a18cff2c24cb10a23e6d0fca5d7c495c3af0c09.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3845033191220101958" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/bd79faeab2d57258b837d8e3cdc705c4157d90126dce928184d7c10dd47d2e15.zip" -> "builds/dbe0d9ab907c175def5c88938a18cff2c24cb10a23e6d0fca5d7c495c3af0c09.zip"
          ~ "timestamp" = "1758687672743285800" -> "1758702862451723000"
        }
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] (deposed object 35c0b7c3) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "4273068299202009682" -> null
      - triggers = {
          - "filename"  = "builds/038b6afd1b996bd50fc7bf401c90990f7f8da8fb0515f1754075775ae16fe3f3.zip"
          - "timestamp" = "1756361702249567000"
        } -> null
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] (deposed object 84360f5d) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1656840544843346760" -> null
      - triggers = {
          - "filename"  = "builds/5ebdb3e93394b6baf0c46bc3de1f053808891fcb8737fe769e1a1cbce77bc296.zip"
          - "timestamp" = "1758684143777912000"
        } -> null
    }

  # module.sbeacon.module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:12" -> (known after apply)
      ~ code_sha256                 = "iUPA0d1bJ+b13VhBT0wCSHyJMS7eodyY15VLOBhXS6k=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-24T03:25:29.968+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:12" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/9c3c8e0d842f528839ef05201bf321cd86234985f1f4f3162e7b5b3afcbc83c6.zip" -> "builds/b543027660ad53ae52d1e355a7d853e848201fe0fbf885fd5645831d03449398.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 120512 -> (known after apply)
      ~ version                     = "12" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_lambda_layer_version.this[0] (deposed object 80f27cbf) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lambda_layer_version" "this" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:11" -> null
      - code_sha256                 = "kDqg5VT3RgExva9aDo0IBXb21rox9U6O24m9TFenIPY=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-08-28T06:18:04.781+0000" -> null
      - description                 = "python libraries" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:11" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer" -> null
      - layer_name                  = "sbeacon_backend_python_modules_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - s3_bucket                   = "gaspi-lambda-layers20250519061959773600000003" -> null
      - s3_key                      = "builds/c3f360141f7543f284da3a1da75bf6ad42db5e5b3c29ca337dcb26bf204a7abd.zip" -> null
      - skip_destroy                = false -> null
      - source_code_size            = 120546 -> null
      - version                     = "11" -> null
        # (5 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers20250519061959773600000003/builds/9c3c8e0d842f528839ef05201bf321cd86234985f1f4f3162e7b5b3afcbc83c6.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "6a86bf84eea2cf2fa635920cab1effe3" -> (known after apply)
      ~ id                            = "gaspi-lambda-layers20250519061959773600000003/builds/9c3c8e0d842f528839ef05201bf321cd86234985f1f4f3162e7b5b3afcbc83c6.zip" -> (known after apply)
      ~ key                           = "builds/9c3c8e0d842f528839ef05201bf321cd86234985f1f4f3162e7b5b3afcbc83c6.zip" -> "builds/b543027660ad53ae52d1e355a7d853e848201fe0fbf885fd5645831d03449398.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/9c3c8e0d842f528839ef05201bf321cd86234985f1f4f3162e7b5b3afcbc83c6.zip" -> "builds/b543027660ad53ae52d1e355a7d853e848201fe0fbf885fd5645831d03449398.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0] (deposed object e090c026) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_s3_object" "lambda_package" {
      - acl                           = "private" -> null
      - arn                           = "arn:aws:s3:::gaspi-lambda-layers20250519061959773600000003/builds/c3f360141f7543f284da3a1da75bf6ad42db5e5b3c29ca337dcb26bf204a7abd.zip" -> null
      - bucket                        = "gaspi-lambda-layers20250519061959773600000003" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "application/octet-stream" -> null
      - etag                          = "ae66c157da1309f2295eeff636660487" -> null
      - force_destroy                 = false -> null
      - id                            = "gaspi-lambda-layers20250519061959773600000003/builds/c3f360141f7543f284da3a1da75bf6ad42db5e5b3c29ca337dcb26bf204a7abd.zip" -> null
      - key                           = "builds/c3f360141f7543f284da3a1da75bf6ad42db5e5b3c29ca337dcb26bf204a7abd.zip" -> null
      - metadata                      = {} -> null
      - region                        = "ap-southeast-3" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "builds/c3f360141f7543f284da3a1da75bf6ad42db5e5b3c29ca337dcb26bf204a7abd.zip" -> null
      - storage_class                 = "ONEZONE_IA" -> null
      - tags                          = {} -> null
      - tags_all                      = {
          - "Environment" = "uat"
          - "NAME"        = "sbeacon-backend"
          - "Owner"       = "gaspi"
        } -> null
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/b543027660ad53ae52d1e355a7d853e848201fe0fbf885fd5645831d03449398.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/b543027660ad53ae52d1e355a7d853e848201fe0fbf885fd5645831d03449398.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1641434570792669069" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/9c3c8e0d842f528839ef05201bf321cd86234985f1f4f3162e7b5b3afcbc83c6.zip" -> "builds/b543027660ad53ae52d1e355a7d853e848201fe0fbf885fd5645831d03449398.zip"
          ~ "timestamp" = "1758684130625685000" -> "1758702850943837000"
        }
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] (deposed object 0759c4d4) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1370252092250279596" -> null
      - triggers = {
          - "filename"  = "builds/c3f360141f7543f284da3a1da75bf6ad42db5e5b3c29ca337dcb26bf204a7abd.zip"
          - "timestamp" = "1756361686135562000"
        } -> null
    }

  # module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4340146740144459520" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684130767557000" -> "1758702849630027000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-dbsnp"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:14",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2654985045950029865" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684146557715800" -> "1758702864845182000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-gnomad"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:14",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8639167893605562606" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684146525074000" -> "1758702864835230200"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/db1824a66f5bca8492b3db281535ed4431efb07f4a4032889484c23cde99cc3c.zip" -> "builds/9934b39ce9810f670883b0ddae38d507e97916558c70f894eab7b3a83ae38927.zip"
        id                             = "pgxflow-backend-lookup"
      ~ last_modified                  = "2025-09-24T04:25:22.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:14",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_lookup/lambda/lookup",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/9934b39ce9810f670883b0ddae38d507e97916558c70f894eab7b3a83ae38927.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/9934b39ce9810f670883b0ddae38d507e97916558c70f894eab7b3a83ae38927.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7800733612387065425" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/db1824a66f5bca8492b3db281535ed4431efb07f4a4032889484c23cde99cc3c.zip" -> "builds/9934b39ce9810f670883b0ddae38d507e97916558c70f894eab7b3a83ae38927.zip"
          ~ "timestamp" = "1758684146551382000" -> "1758702864927675000"
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-lookup-updateReferenceFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "189444549931881149" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684146376045000" -> "1758702864941647000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_pharmcat_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:cd94bd2d5eada1504a5d620ad75e228f97ab95671362b239a0f6d9972f2129ce496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:cd94bd2d5eada1504a5d620ad75e228f97ab95671362b239a0f6d9972f2129ce" -> (known after apply)
        name         = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers"
      ~ repo_digest  = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers@sha256:c5b7e0252ba7dfc496b133035e7a0f94d13839c9e4103e58100f78fa993b3385" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "657f9460ce7675177368ec099a036a921593b06b" -> "d3d37b931ae36c97332d72b49b733bdd5dd3365f"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "pgxflow/pipeline_pharmcat/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "pgxflow/pipeline_pharmcat/lambda/pharmcat" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "pgxflow/pipeline_pharmcat/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "pgxflow/pipeline_pharmcat/lambda/pharmcat"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_pharmcat_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:c5b7e0252ba7dfc496b133035e7a0f94d13839c9e4103e58100f78fa993b3385" -> (known after apply)
        name                 = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers"
      ~ sha256_digest        = "sha256:c5b7e0252ba7dfc496b133035e7a0f94d13839c9e4103e58100f78fa993b3385" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "657f9460ce7675177368ec099a036a921593b06b" -> "d3d37b931ae36c97332d72b49b733bdd5dd3365f"
        }
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_pharmcat_lambda.docker_registry_image.this (deposed object 794c685d) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "docker_registry_image" "this" {
      - id                   = "sha256:4d91b86508140bf061db30f3b9068f6a27237f77b5d7ec3d0833f17bc0a75c91" -> null
      - insecure_skip_verify = false -> null
      - keep_remotely        = false -> null
      - name                 = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers" -> null
      - sha256_digest        = "sha256:c5b7e0252ba7dfc496b133035e7a0f94d13839c9e4103e58100f78fa993b3385" -> null
      - triggers             = {
          - "dir_sha" = "aa6469a3219405b5d0b44e99816765131fc98ae7"
        } -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_preprocessor_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "519269b64fedb3df7f753fccdb6a0b35d078425f"
        }

      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "pgxflow/pipeline_pharmcat/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "pgxflow/pipeline_pharmcat/lambda/preprocessor"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_preprocessor_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:855f1c9573bf91e7363566e0f31d9a2505397a5745d413b8b8d6f3bfff58cbfa" -> (known after apply)
        name                 = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers"
      ~ sha256_digest        = "sha256:855f1c9573bf91e7363566e0f31d9a2505397a5745d413b8b8d6f3bfff58cbfa" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "126c630851ca139a64af60427b9eec6625f31dda" -> "519269b64fedb3df7f753fccdb6a0b35d078425f"
        }
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-pharmcat-gnomad"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:14",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2572621044293385217" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684146768543000" -> "1758702865144084000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.null_resource.archive[0] (deposed object 2a542534) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "149014663867816729" -> null
      - triggers = {
          - "filename"  = "builds/a928cd25a8d6530207d17e12f0148b7fc2b7557fb65cdb5f1a054735bf0ec4f4.zip"
          - "timestamp" = "1756361703435441000"
        } -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-pharmcat"
      ~ image_uri                      = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers@sha256:c5b7e0252ba7dfc496b133035e7a0f94d13839c9e4103e58100f78fa993b3385" -> (known after apply)
      ~ last_modified                  = "2025-09-24T04:25:39.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-postprocessor"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:14",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_libraries_layer:9",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8916805434714493207" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684146732132000" -> "1758702865159771000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] (deposed object 99050145) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "3443380393044919661" -> null
      - triggers = {
          - "filename"  = "builds/8b6fc09523824b0961b9e45bdede7e982e366ee01d4331fd371a0d1e146d97c6.zip"
          - "timestamp" = "1756361703460875000"
        } -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-preprocessor"
      ~ image_uri                      = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers@sha256:855f1c9573bf91e7363566e0f31d9a2505397a5745d413b8b8d6f3bfff58cbfa" -> (known after apply)
      ~ last_modified                  = "2025-08-28T06:18:48.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-pharmcat-updateReferenceFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6882072162300187590" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758684146622274000" -> "1758702865040392000"
            # (1 unchanged element hidden)
        }
    }

Plan: 74 to add, 39 to change, 104 to destroy.
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.local_file.archive_plan[0]: Creating...
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.local_file.archive_plan[0]: Creation complete after 0s [id=85006c6cd69e7fb094f6eb80734581ac1e389f6d]
module.pgxflow[0].aws_lambda_layer_version.binaries_layer: Creating...
module.pgxflow[0].module.python_libraries_layer.local_file.archive_plan[0]: Creating...
module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0]: Creating...
module.pgxflow[0].module.python_libraries_layer.local_file.archive_plan[0]: Creation complete after 0s [id=d84a4778f9f85a523d10f0c529bb31b6405961de]
module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0]: Creating...
module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0]: Creation complete after 0s [id=c74ae2c924baa9ea3a12a7bb0eda9858d11856a7]
module.pgxflow[0].module.python_modules_layer.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0]: Creating...
module.sbeacon.module.python_modules_layer.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0]: Creation complete after 1s [id=4cd9db51f3b932158802c657840ef1e245f4218e]
module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0]: Creation complete after 1s [id=5a287a3b50af58f722b342b3563717023d159ba8]
module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-admin.local_file.archive_plan[0]: Creating...
module.pgxflow[0].module.python_modules_layer.local_file.archive_plan[0]: Creation complete after 1s [id=2d396c6fcad0c81137b1350c641ff10d10aeb11c]
module.pgxflow[0].module.docker_image_qcFigures_lambda.docker_image.this: Creating...
module.sbeacon.module.python_modules_layer.local_file.archive_plan[0]: Creation complete after 0s [id=d39fc175dd82a9c50cd91387ddb6f42ed1579d03]
module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-admin.local_file.archive_plan[0]: Creation complete after 0s [id=9cae82c8e70697963a9e5b772ac7f91c4c3c05d4]
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0]: Creating...
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0]: Creating...
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0]: Creating...
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0]: Creating...
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0]: Creating...
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0]: Creating...
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0] (local-exec): zip: creating 'builds/3316265c984f10f28b74b942f005ca4bb3c4c820411309d6cad169ca769dffd9.zip' archive
module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/292/default/pgxflow/pipeline_lookup/lambda/gnomad
module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0] (local-exec): Created: builds/3316265c984f10f28b74b942f005ca4bb3c4c820411309d6cad169ca769dffd9.zip
module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0]: Creation complete after 0s [id=7868226085199280181]
module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0]: Creating...
module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0] (local-exec): zip: creating 'builds/08e9ac66aa91b1fa215c5f717ba16651bdffb481e2e36bdfac525a6b1f984e99.zip' archive
module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/292/default/pgxflow/lambda/initFlow
module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0] (local-exec): zip: adding: dynamodb.py
module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0] (local-exec): zip: adding: lookup.py
module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0] (local-exec): zip: adding: pharmcat.py
module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0] (local-exec): Created: builds/08e9ac66aa91b1fa215c5f717ba16651bdffb481e2e36bdfac525a6b1f984e99.zip
module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0]: Creation complete after 0s [id=5521797399137766219]
module.pgxflow[0].module.lambda-batchStarter.null_resource.archive[0]: Creating...
module.pgxflow[0].module.lambda-batchStarter.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: creating 'builds/b2aa315848da684e512f08a084330d1fe4fc5310bc70674df2bd154c68a31c04.zip' archive
module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): zip: creating 'builds/b13c4a78bd55bc20d4dc8147578c931acb0b836487b00cbfec051c64a7693bf8.zip' archive
module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/292/default/pgxflow/lambda/getResultsURL
module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0] (local-exec): Created: builds/b13c4a78bd55bc20d4dc8147578c931acb0b836487b00cbfec051c64a7693bf8.zip
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0] (local-exec): zip: creating 'builds/9934b39ce9810f670883b0ddae38d507e97916558c70f894eab7b3a83ae38927.zip' archive
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/292/default/pgxflow/pipeline_lookup/lambda/lookup
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0] (local-exec): zip: adding: __pycache__/
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0] (local-exec): zip: adding: __pycache__/lambda_function.cpython-312.pyc
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0] (local-exec): Created: builds/9934b39ce9810f670883b0ddae38d507e97916558c70f894eab7b3a83ae38927.zip
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/292/default/pgxflow/pipeline_pharmcat/lambda/updateReferenceFiles
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: pharmcat.py
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: pharmcat.sh
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: version_checks.py
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): Created: builds/b2aa315848da684e512f08a084330d1fe4fc5310bc70674df2bd154c68a31c04.zip
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] (local-exec): zip: creating 'builds/8b6fc09523824b0961b9e45bdede7e982e366ee01d4331fd371a0d1e146d97c6.zip' archive
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0]: Creation complete after 1s [id=5808186051544246259]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/292/default/pgxflow/pipeline_pharmcat/lambda/postprocessor
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] (local-exec): zip: adding: drugs.py
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] (local-exec): zip: adding: genes.py
module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0]: Creation complete after 1s [id=3752913916234341351]
module.pgxflow[0].module.lambda-sendJobEmail.null_resource.archive[0]: Creating...
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): zip: creating 'builds/0ab4695261445c275b666691d159b2827f1a283a9dbdb793347795a9ed72494d.zip' archive
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): Installing python requirements: cognito/lambda/sendRegistrationEmail/requirements.txt
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): > mktemp -d terraform-aws-lambda-XXXXXXXX # /tmp/terraform-aws-lambda-3u_5mr9t
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): > cd /tmp/terraform-aws-lambda-3u_5mr9t
module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (local-exec): > python3.12 -m pip install --no-compile --prefix= --target=. --requirement=requirements.txt
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-updateReferenceFiles.null_resource.archive[0]: Creation complete after 1s [id=1913637297236843711]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] (local-exec): zip: adding: messages.py
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] (local-exec): zip: adding: utils.py
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] (local-exec): Created: builds/8b6fc09523824b0961b9e45bdede7e982e366ee01d4331fd371a0d1e146d97c6.zip
module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0]: Creating...
module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): zip: creating 'builds/5fcae5daff2ded5d6ba61b1a0dc3b0d861470d10c1d6f29710fd8a344e6ba81c.zip' archive
module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/292/default/pgxflow/lambda/qcNotes
module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0] (local-exec): Created: builds/5fcae5daff2ded5d6ba61b1a0dc3b0d861470d10c1d6f29710fd8a344e6ba81c.zip
module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.lambda-sendJobEmail.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0]: Creation complete after 1s [id=533334151603583311]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0]: Creation complete after 1s [id=7676285822637602780]
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0]: Creating...
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0]: Creating...
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0]: Provisioning with 'local-exec'...
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0] (local-exec): zip: creating 'builds/7f3d5d2365929c58630c64ceb3bbaee0dc7b160819f471756fc493fda696d073.zip' archive
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/292/default/pgxflow/pipeline_lookup/lambda/dbsnp
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0] (local-exec): Created: builds/7f3d5d2365929c58630c64ceb3bbaee0dc7b160819f471756fc493fda696d073.zip
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0]: Creation complete after 0s [id=6913180305795162087]
module.pgxflow[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): zip: creating 'builds/2d26d62301ee609c22b9ce864adea839b0695531c99b94868036112b261aeb3a.zip' archive
module.pgxflow[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/292/default/pgxflow/lambda/sendJobEmail
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0]: Creating...
module.pgxflow[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.pgxflow[0].module.lambda-sendJobEmail.null_resource.archive[0] (local-exec): Created: builds/2d26d62301ee609c22b9ce864adea839b0695531c99b94868036112b261aeb3a.zip
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: creating 'builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip' archive
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/292/default/sbeacon/lambda/getIndividuals
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_filtering_terms.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_id.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_id_biosamples.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): zip: adding: route_individuals_id_g_variants.py
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (local-exec): Created: builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip
module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0]: Creation complete after 0s [id=3787069449785293742]
module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): zip: creating 'builds/4210711773ed925dad12fb420efb6a5ef9a7debed13d0e2751af6c37c3a1638d.zip' archive
module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/292/default/pgxflow/lambda/batchSubmit
module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): zip: adding: dynamodb.py
module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0] (local-exec): Created: builds/4210711773ed925dad12fb420efb6a5ef9a7debed13d0e2751af6c37c3a1638d.zip
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): zip: creating 'builds/a8f4f52fd2bf74768358bcc93ef19fd9d4225b9b50c6d2604117f5d6f0ff138a.zip' archive
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/292/default/cognito/lambda/logEmailDelivery
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] (local-exec): Created: builds/a8f4f52fd2bf74768358bcc93ef19fd9d4225b9b50c6d2604117f5d6f0ff138a.zip
module.pgxflow[0].module.lambda-sendJobEmail.null_resource.archive[0]: Creation complete after 0s [id=5000185344470763507]
module.pgxflow[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): zip: creating 'builds/fe6b6b2df7d0d7d33c906b62c9d022f7e0b8b641a4db7fa99a803c983363bd63.zip' archive
module.pgxflow[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/292/default/pgxflow/lambda/batchStarter
module.pgxflow[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.pgxflow[0].module.lambda-batchStarter.null_resource.archive[0] (local-exec): Created: builds/fe6b6b2df7d0d7d33c906b62c9d022f7e0b8b641a4db7fa99a803c983363bd63.zip
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0]: Creating...
module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0]: Creation complete after 0s [id=6596441518659250835]
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0]: Creating...
module.pgxflow[0].module.lambda-batchStarter.null_resource.archive[0]: Creation complete after 1s [id=8380392608203367202]
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0]: Provisioning with 'local-exec'...
module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getRuns.null_resource.archive[0]: Creating...
module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0]: Creation complete after 0s [id=3143611327108548301]
module.sbeacon.module.lambda-getRuns.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (local-exec): local-exec: Executing: Suppressed by quiet=true
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): zip: creating 'builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.zip' archive
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/292/default/sbeacon/lambda/getConfiguration
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (local-exec): Created: builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.zip
module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (local-exec): zip: creating 'builds/af5bf3b9b67b07d522efa9b0e7ffedcccb023517fee892632475f08f4f7d282c.zip' archive
module.sbeacon.mod
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.